#!/usr/bin/python3

# 6. Реализовать два небольших скрипта:
#    а) итератор, генерирующий целые числа, начиная с указанного,
#    б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#    Подсказка: использовать функцию count() и cycle() модуля itertools.
#    Обратите внимание, что создаваемый цикл не должен быть бесконечным.
#    Необходимо предусмотреть условие его завершения.
#    Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
#    Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.


from itertools import count

a = int(input('Введите начальное число: '))
n = int(input('Введите количество чисел последовательности: '))
for i in count(a):
    print(i, end=' ')
    if i - a + 1 >= n:
        break
